cf_billing/InformationRegisters/бестЦеновыеКатегорииТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестЦеновыеКатегорииТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестЦеновыеКатегорииТочекУчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает ценовую категорию.
//
// Параметры:
//  Период			-	Дата.
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  МКД				-	СправочникСсылка.энргСтроения.
//  ОбъектРасчета	-	СправочникСсылка.бестОбъектыРасчета.
//  ТочкаУчета		-	СправочникСсылка.энргТочкиУчета.
// 
// Возвращаемое значение:
//   ПеречисленияСсылка.бестЦеновыеКатегории.
//
Функция ПолучитьЦеновуюКатегорию(Период, Организация, Район, МКД, ОбъектРасчета, ТочкаУчета) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестЦеновыеКатегорииТочекУчетаСрезПоследних.ЦеноваяКатегория КАК ЦеноваяКатегория
		|ИЗ
		|	РегистрСведений.бестЦеновыеКатегорииТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И МКД = &МКД
		|				И ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета) КАК бестЦеновыеКатегорииТочекУчетаСрезПоследних";
	
	Запрос.УстановитьПараметр("МКД", МКД);
	Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЦеноваяКатегория;
	КонецЦикла;
	
	Возврат Перечисления.бестЦеновыеКатегории.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
